# St7GetBrickLabelStyle

Returns the display style for brick labels.

long St7GetBrickLabelStyle(long uID, long* LabelStyle)
Input Parameters
uID
Strand7 model file ID.
Output Parameters
LabelStyle
One of lsNone, lsEntityNumber, lsIDNumber, lsPropertyNumber, lsPropertyName or lsPropertyType.